vendor/webex/nbr/NBR_XML.wsdl

<wsdl:definitions
targetNamespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"
xmlns:tns1="nbrXmlService"
xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
xmlns:apachesoap="http://xml.apache.org/xml-soap"
xmlns:impl="http://nta1wss.webex.com/nbr/services/nbrXmlService"
xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:intf="http://nta1wss.webex.com/nbr/services/nbrXmlService">
<!--WSDL created by Apache Axis version: 1.4
Built on Apr 22, 2006 (06:55:48 PDT)-->
    <wsdl:message name="getMeetingTicketResponse">
        <wsdl:part name="getMeetingTicketReturn" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getNBRRecordIdListResponse">
        <wsdl:part name="getNBRRecordIdListReturn"
        type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="getSCXmlRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getNBRConfIdListRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getMeetingXmlResponse">
        <wsdl:part name="getMeetingXmlReturn" type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="getNBRXmlForReportResponse">
        <wsdl:part name="getNBRXmlForReportReturn"
        type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="getMeetingXmlRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getSCXmlReportResponse">
        <wsdl:part name="getSCXmlReportReturn" type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="getNBRRecordIdListRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="userName" type="xsd:string"/>
        <wsdl:part name="password" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="deleteMeetingXmlResponse">
        <wsdl:part name="deleteMeetingXmlReturn" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getSCXmlReportRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="hashKey" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getNBRConfIdListResponse">
        <wsdl:part name="getNBRConfIdListReturn" type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="deleteMeetingXmlRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="ticket" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getMeetingTicketRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="username" type="xsd:string"/>
        <wsdl:part name="password" type="xsd:string"/>
        <wsdl:part name="service" type="xsd:string"/>
    </wsdl:message>
    <wsdl:message name="getSCXmlResponse">
        <wsdl:part name="getSCXmlReturn" type="tns1:Document"/>
    </wsdl:message>
    <wsdl:message name="getNBRXmlForReportRequest">
        <wsdl:part name="siteId" type="xsd:long"/>
        <wsdl:part name="confId" type="xsd:long"/>
        <wsdl:part name="hashKey" type="xsd:string"/>
    </wsdl:message>
    <wsdl:portType name="NBRXmlService">
        <wsdl:operation name="getNBRConfIdList" parameterOrder="siteId
            ticket">
            <wsdl:input name="getNBRConfIdListRequest"
            message="impl:getNBRConfIdListRequest"/>
            <wsdl:output name="getNBRConfIdListResponse"
            message="impl:getNBRConfIdListResponse"/>
        </wsdl:operation>
        <wsdl:operation name="getMeetingXml" parameterOrder="siteId
            confId ticket">
            <wsdl:input name="getMeetingXmlRequest"
            message="impl:getMeetingXmlRequest"/>
            <wsdl:output name="getMeetingXmlResponse"
            message="impl:getMeetingXmlResponse"/>
        </wsdl:operation>
        <wsdl:operation name="getNBRRecordIdList" parameterOrder="siteId userName password">
            <wsdl:input name="getNBRRecordIdListRequest"
            message="impl:getNBRRecordIdListRequest"/>
            <wsdl:output name="getNBRRecordIdListResponse"
            message="impl:getNBRRecordIdListResponse"/>
        </wsdl:operation>
        <wsdl:operation name="deleteMeetingXml" parameterOrder="siteId confId ticket">
            <wsdl:input name="deleteMeetingXmlRequest"
            message="impl:deleteMeetingXmlRequest"/>
            <wsdl:output name="deleteMeetingXmlResponse"
            message="impl:deleteMeetingXmlResponse"/>
        </wsdl:operation>
        <wsdl:operation name="getMeetingTicket" parameterOrder="siteId username password service">
            <wsdl:input name="getMeetingTicketRequest"
            message="impl:getMeetingTicketRequest"/>
            <wsdl:output name="getMeetingTicketResponse"
            message="impl:getMeetingTicketResponse"/>
        </wsdl:operation>
        <wsdl:operation name="getSCXml" parameterOrder="siteId confId ticket">
            <wsdl:input name="getSCXmlRequest"
            message="impl:getSCXmlRequest"/>
            <wsdl:output name="getSCXmlResponse"
            message="impl:getSCXmlResponse"/>
        </wsdl:operation>
        <wsdl:operation name="getSCXmlReport" parameterOrder="siteId confId hashKey">
            <wsdl:input name="getSCXmlReportRequest"
            message="impl:getSCXmlReportRequest"/>
            <wsdl:output name="getSCXmlReportResponse"
            message="impl:getSCXmlReportResponse"/>
        </wsdl:operation>
        <wsdl:operation name="getNBRXmlForReport" parameterOrder="siteId confId hashKey">
            <wsdl:input name="getNBRXmlForReportRequest"
            message="impl:getNBRXmlForReportRequest"/>
            <wsdl:output name="getNBRXmlForReportResponse"
            message="impl:getNBRXmlForReportResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="nbrXmlServiceSoapBinding"
        type="impl:NBRXmlService">
        <wsdlsoap:binding style="rpc"
        transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="getNBRConfIdList">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getNBRConfIdListRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getNBRConfIdListResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="getMeetingXml">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getMeetingXmlRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getMeetingXmlResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="getNBRRecordIdList">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getNBRRecordIdListRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getNBRRecordIdListResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="deleteMeetingXml">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="deleteMeetingXmlRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="deleteMeetingXmlResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="getMeetingTicket">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getMeetingTicketRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getMeetingTicketResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="getSCXml">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getSCXmlRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getSCXmlResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="getSCXmlReport">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getSCXmlReportRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getSCXmlReportResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
        <wsdl:operation name="getNBRXmlForReport">
            <wsdlsoap:operation soapAction=""/>
            <wsdl:input name="getNBRXmlForReportRequest">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://wbxservice.nbr.webservice.webex.com"/>
            </wsdl:input>
            <wsdl:output name="getNBRXmlForReportResponse">
                <wsdlsoap:body use="encoded"
                encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
                namespace="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="NBRXmlServiceService">
        <wsdl:port name="nbrXmlService"
        binding="impl:nbrXmlServiceSoapBinding">
            <wsdlsoap:address
            location="http://nta1wss.webex.com/nbr/services/nbrXmlService"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>