wbx.getNBRRecordIdList.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wbx="http://wbxservice.nbr.webservice.webex.com">
   <soapenv:Header/>
   <soapenv:Body>
      <wbx:getNBRRecordIdList soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <siteId xsi:type="xsd:long">?</siteId>
         <userName xsi:type="xsd:string">?</userName>
         <password xsi:type="xsd:string">?</password>
      </wbx:getNBRRecordIdList>
   </soapenv:Body>
</soapenv:Envelope>
