wbx.getMeetingXml.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Body>
        <ns1:getMeetingXml soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="nbrXmlService">
            <siteID>?</siteID >
            <confId>?</confId>
            <ticket>?</ticket>
        </ns1:getMeetingXml>
    </soapenv:Body>
</soapenv:Envelope>